#!/bin/bash
#----------------------------------------
# 初期設定
#----------------------------------------
if [ $# -le 0 ]; then
	echo "パラメタが不足しています。"${SCRIPT_NAME}"の処理を終了します。"
    exit ${INVALID_PARAMETER_ERR} 
fi

# ROOTパス
ROOT_PATH=$1

#----------------------------------------
# 初期処理
#----------------------------------------
if [ -r "${ROOT_PATH}"/etc/common.sh ]
then
	. "${ROOT_PATH}"/etc/common.sh
else
	# 存在確認エラーメッセージ出力
	echo "共通処理ファイルの読み込みに失敗しました。処理を終了します。"
	exit 31
fi

#----------------------------------------
# ライブラリの読み込み
#----------------------------------------
# INCLUDE filename

#----------------------------------------
# Main処理
#----------------------------------------

# main